ubuntu_compose.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>压缩</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="压缩"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-11 Wed"/>
<meta name="author" content="Joseph Pan"/>
<meta name="description" content="Ubuntu压缩"/>
<meta name="keywords" content="Ubuntu 压缩 7zip zip rar"/>
<link rel="stylesheet" href="./other/style.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="./ubuntu_index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">压缩</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 压缩软件</a>
<ul>
<li><a href="#sec-1-1">1.1 增加 7Z 压缩软件</a></li>
<li><a href="#sec-1-2">1.2 增加 rar 软件压缩和解压缩支持</a></li>
<li><a href="#sec-1-3">1.3 增加 zip 格式压缩和解压缩支持</a></li>
<li><a href="#sec-1-4">1.4 增加 lha 支持</a></li>
<li><a href="#sec-1-5">1.5 增加解 cab 文件支持</a></li>
</ul>
</li>
<li><a href="#sec-2">2 解压</a>
<ul>
<li><a href="#sec-2-1">2.1 解压缩 xxx.tar.gz</a></li>
<li><a href="#sec-2-2">2.2 解压缩 xxx.tar.bz2</a></li>
</ul>
</li>
<li><a href="#sec-3">3 压缩</a>
<ul>
<li><a href="#sec-3-1">3.1 压缩aaa bbb目录为xxx.tar.gz</a></li>
<li><a href="#sec-3-2">3.2 压缩aaa bbb目录为xxx.tar.bz2</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 压缩软件</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 增加 7Z 压缩软件</h3>
<div class="outline-text-3" id="text-1-1">





<pre class="example">增加 7Z 压缩软件
#支持 7Z,ZIP,Zip64,CAB,RAR,ARJ,GZIP,BZIP2,TAR,CPIO,RPM,ISO,DEB 压缩文件格式
sudo apt-get install p7zip p7zip-full p7zip-rar
#将所有已txt结尾的文件都加入到files.7z
7z a -t7z files.7z *.txt
#解压缩files.zip
7z x files.zip
#删除 files.zip中所有已bak结尾的文件
7z d -r files.zip *.bak 
#列出file.7z中所有的文件信息
7z l files.7z
#测试files.zip中所有doc结尾文件的正确性
7z t -r files.zip *.doc 
#更新files.zip中的所有doc结尾的文件（不是所有的压缩格式都支持更新这一选项）
7z u files.zip *.doc
</pre>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 增加 rar 软件压缩和解压缩支持</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="example">sudo apt-get install rar unrar
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 增加 zip 格式压缩和解压缩支持</h3>
<div class="outline-text-3" id="text-1-3">





<pre class="example">sudo apt-get install zip unzip
</pre>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 增加 lha 支持</h3>
<div class="outline-text-3" id="text-1-4">





<pre class="example">sudo apt-get install lha
</pre>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 增加解 cab 文件支持</h3>
<div class="outline-text-3" id="text-1-5">





<pre class="example">sudo apt-get install cabextract
</pre>




</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 解压</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 解压缩 xxx.tar.gz</h3>
<div class="outline-text-3" id="text-2-1">





<pre class="example">tar -zxvf xxx.tar.gz
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 解压缩 xxx.tar.bz2</h3>
<div class="outline-text-3" id="text-2-2">





<pre class="example">tar -jxvf xxx.tar.bz2
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 压缩</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 压缩aaa bbb目录为xxx.tar.gz</h3>
<div class="outline-text-3" id="text-3-1">





<pre class="example">tar -zcvf xxx.tar.gz aaa bbb
</pre>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 压缩aaa bbb目录为xxx.tar.bz2</h3>
<div class="outline-text-3" id="text-3-2">





<pre class="example">tar -jcvf xxx.tar.bz2 aaa bbb
</pre>



</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-11 Wed</p>
<p class="author">Author: Joseph Pan</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
